## Import Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

----

### Extract CSVs into DataFrames

In [2]:
pokemon_file = "Resources/pokemon-spawns.csv"
pokemon_data_df = pd.read_csv(pokemon_file)
pokemon_data_df = pokemon_data_df[["s2_token", "name", "lat", "lng"]]
pokemon_data_df.head()

      s2_token     name        lat         lng
0  8085808cc6d   Weedle  37.793592 -122.408721
1  8085808b51d   Pidgey  37.794746 -122.406420
2  8085808b271    Zubat  37.794999 -122.404384
3  808580f3587   Pidgey  37.795644 -122.407128
4  808580f4b1d  Poliwag  37.795592 -122.406331

In [3]:
police_data_df = pd.read_csv("Resources/police-department-incidents.csv")
police_data_df = police_data_df[["IncidntNum", "Descript", "PdDistrict", "Resolution", "X", "Y"]]
police_data_df.head()

,IncidntNum,Descript,PdDistrict,Resolution,X,Y
0,50436712,BATTERY,MISSION,NONE,-122.435003,37.760888
1,130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.444707,37.724931
2,141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.407102,37.762558
3,51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.403847,37.789828
4,140684794,BATTERY,BAYVIEW,NONE,-122.402554,37.765419

In [6]:
decimals = 5
pokemon_data_df['lat'] = pokemon_data_df['lat'].apply(lambda x: round(x, decimals))
pokemon_data_df['lng'] = pokemon_data_df['lng'].apply(lambda x: round(x, decimals))
police_data_df['X'] = police_data_df['X'].apply(lambda x: round(x, decimals))
police_data_df['Y'] = police_data_df['Y'].apply(lambda x: round(x, decimals))

----

### Transform pokemon DataFrame

In [7]:
new_poke_df = pokemon_data_df[[\
    's2_token','name','lat','lng']].copy()
new_poke_df.head()

      s2_token     name       lat        lng
0  8085808cc6d   Weedle  37.79359 -122.40872
1  8085808b51d   Pidgey  37.79475 -122.40642
2  8085808b271    Zubat  37.79500 -122.40438
3  808580f3587   Pidgey  37.79564 -122.40713
4  808580f4b1d  Poliwag  37.79559 -122.40633

In [8]:
new_poke_df['id']=new_poke_df.index
new_poke_df.head()

      s2_token     name       lat        lng  id
0  8085808cc6d   Weedle  37.79359 -122.40872   0
1  8085808b51d   Pidgey  37.79475 -122.40642   1
2  8085808b271    Zubat  37.79500 -122.40438   2
3  808580f3587   Pidgey  37.79564 -122.40713   3
4  808580f4b1d  Poliwag  37.79559 -122.40633   4

In [9]:
'''for nam in new_poke_df[['name']]:
    if nam == 'Nidoran♀':
        nam = 'Nidoran'
        print('success')'''

"for nam in new_poke_df[['name']]:\n    if nam == 'Nidoran♀':\n        nam = 'Nidoran'\n        print('success')"

In [10]:
new_poke_df = new_poke_df[['id','name','lat','lng']]
new_poke_df.head()
new_poke_df.set_index("id", inplace=True)
#new_poke_df.head()

In [11]:
#change column names for new_poke_df
'''new_poke_df.rename(columns={'id':'id',
    'num':''},
    'name':'',
    'encounter_ms':'',
    'disppear_ms'},
    inplace=True)
new_poke_df.drop_duplicates("id", inplace=True)
new_poke_df.set_index("index", inplace=True)
new_poke_df.head()'''

'new_poke_df.rename(columns={\'id\':\'id\',\n    \'num\':\'\'},\n    \'name\':\'\',\n    \'encounter_ms\':\'\',\n    \'disppear_ms\'},\n    inplace=True)\nnew_poke_df.drop_duplicates("id", inplace=True)\nnew_poke_df.set_index("index", inplace=True)\nnew_poke_df.head()'

### Transform police DataFrame

In [12]:
police_data_df = police_data_df[[\
    "IncidntNum", "Descript", "PdDistrict", "Resolution", "X", "Y"]].copy()
police_data_df.head()

,IncidntNum,Descript,PdDistrict,Resolution,X,Y
0,50436712,BATTERY,MISSION,NONE,-122.43500,37.76089
1,130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.44471,37.72493
2,141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.40710,37.76256
3,51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.40385,37.78983
4,140684794,BATTERY,BAYVIEW,NONE,-122.40255,37.76542

In [13]:
#change column names for new_police_df
police_data_df.rename(columns={'IncidntNum':'inc_num',
    'Descript':'descr',
    'PdDistrict':'district',
    'Resolution':'resolution',
    'X':'lng',
    'Y':'lat'}, 
    inplace=True)
police_data_df.set_index("inc_num", inplace=True)
police_data_df.head()

,descr,district,resolution,lng,lat
inc_num,,,,,
50436712,BATTERY,MISSION,NONE,-122.43500,37.76089
130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.44471,37.72493
141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.40710,37.76256
51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.40385,37.78983
140684794,BATTERY,BAYVIEW,NONE,-122.40255,37.76542

In [14]:
poke_5 = new_poke_df.round({'lat': 5, 'lng': 5})
poke_5.head()

       name       lat        lng
id
0    Weedle  37.79359 -122.40872
1    Pidgey  37.79475 -122.40642
2     Zubat  37.79500 -122.40438
3    Pidgey  37.79564 -122.40713
4   Poliwag  37.79559 -122.40633

### Create database connection

In [15]:
#rds_connection_string = "<inser user name>:<insert password>@127.0.0.1/customer_db"
#engine = create_engine(f'mysql://{rds_connection_string}')
engine = create_engine(f'mysql://root:Redondo0505@localhost:3306/pokemon_police_db')

In [16]:
# Confirm tables
engine.table_names()

['pokemon', 'police']

### Load DataFrames into database

In [17]:
new_poke_df.to_sql(name='pokemon', con=engine, if_exists='append', index=True, chunksize=2000)

In [18]:
police_data_df.to_sql(name='police', con=engine, if_exists='replace', index=True, chunksize=2000)

In [19]:
pd.read_sql_query('select * from pokemon', con=engine).head()

   id     name       lat        lng
0   0   Weedle  37.79359 -122.40872
1   1   Pidgey  37.79475 -122.40642
2   2    Zubat  37.79500 -122.40438
3   3   Pidgey  37.79564 -122.40713
4   4  Poliwag  37.79559 -122.40633

In [20]:
pd.read_sql_query('select * from police', con=engine).head()

,inc_num,descr,district,resolution,lng,lat
0,50436712,BATTERY,MISSION,NONE,-122.43500,37.76089
1,130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.44471,37.72493
2,141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.40710,37.76256
3,51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.40385,37.78983
4,140684794,BATTERY,BAYVIEW,NONE,-122.40255,37.76542